/*
 * =====================================================================================
 *
 *       Filename:  4-07.c
 *
 *    Description:  输出双精度数时的有效位数 P79
 *
 *        Version:  1.0
 *        Created:  2010年03月01日 06时08分21秒
 *       Revision:  none
 *       Compiler:  gcc
 *
 *         Author:  Crackpot
 *        Company:  
 *
 * =====================================================================================
 */

#include<stdio.h>
int main() {
    double x, y;
    x = 1111111111111.111111111;
    y = 2222222222222.222222222;
    printf("%f\n", x + y);
    return 0;
}
