xmc_rails/app/controllers/entries_controller.rb

  def sign_in
    @name = params[:visitor_name]

    if !@name.blank? then
      @entry = Entry.create({:name => @name})
    end

    @entries = Entry.all
---
INSERT INTO `entries` (`created_at`, `name`, `updated_at`) VALUES ('2012-10-31 13:24:40', NULL, '2012-10-31 13:24:40')
SELECT `entries`.* FROM `entries`