# -*- coding: utf-8 -*-
cg1 = {
	'1':'故宫在哪里?(回复数字):%(cmd)s1北京,%(cmd)s2杭州',
	'2':'故宫在哪里?(回复数字):%(cmd)s1杭州,%(cmd)s2北京',
}

cg2 = {
	'1': '第2关,超女是指什么人？(回复数字):%(cmd)s1参加超级女声的女孩;%(cmd)s2超能力女孩',
	'2': '第2关,超女是指什么人？(回复数字):%(cmd)s1超能力女孩;%(cmd)s2参加超级女声的女孩',
}
cg3 = {
    '1':'子弹打在玻璃上往往只能穿个小孔因为?%(cmd)s1速度太快;%(cmd)s2子弹太小',
    '2':'子弹打在玻璃上往往只能穿个小孔因为?%(cmd)s1子弹太小;%(cmd)s2速度太快',
}
cg4 = {
    '1':'“琴棋书画”中的“棋”指(回复数字):%(cmd)s1围棋；%(cmd)s2象棋',
    '2':'“琴棋书画”中的“棋”指(回复数字):%(cmd)s1象棋；%(cmd)s2围棋',
}
cg5 = {
	'1':'我国名花中有“凌波仙子”之称的是?%(cmd)s1水仙花,%(cmd)s2兰花',
	'2':'我国名花中有“凌波仙子”之称的是?%(cmd)s1兰花,%(cmd)s2水仙花',
}
