/*
 * =====================================================================================
 *
 *       Filename:  1-5.c
 *
 *    Description:  输出指定内容                P13
 *
 *        Version:  1.0
 *        Created:  2009年09月18日 19时58分07秒
 *       Revision:  none
 *       Compiler:  gcc
 *
 *         Author:  Crackpot
 *        Company:  
 *
 * =====================================================================================
 */

#include <stdio.h>
int main() {
    printf("******************************\n");
    printf("          Very good!          \n");
    printf("******************************\n");
    return 0;
}

